{
	"Minutes of The Fifteenth Meeting of The Board of Governors": {
        "description": "Minutes of The Fifteenth Meeting of The Board of Governors (Transit Board), held on 24 May, 2024 at 12:30PM (Hybrid mode).",
        "url": "/downloads/bog/IIITT_15th_BOG_Minutes.pdf"
    },
	"Minutes of The Fourteenth Meeting of The Board of Governors": {
        "description": "Minutes of The Fourteenth Meeting of The Board of Governors (Transit Board), held on 24 November, 2023 at 11:00AM (Hybrid mode).",
        "url": "/downloads/bog/IIITT_14th_BOG_Minutes.pdf"
    },

	"Minutes of The Thirteenth Meeting of The Board of Governors": {
        "description": "Minutes of The Thirteenth Meeting of The Board of Governors (Transit Board), held on 11 August, 2023 at 04:00PM (Hybrid mode).",
        "url": "/downloads/bog/IIITT_13th_BOG_Minutes.pdf"
    },

	"Minutes of The Twelfth Meeting of The Board of Governors": {
        "description": "Minutes of The Twelfth Meeting of The Board of Governors (Transit Board), held on 28 January, 2023 at 03:15PM (Hybrid mode).",
        "url": "/downloads/bog/IIITT_12th_BOG_Minutes.pdf"
    },

    "Minutes of The Eleventh Meeting of The Board of Governors": {
        "description": "Minutes of The Eleventh Meeting of The Board of Governors (Transit Board), held on 25 October, 2021 at 03:45PM (video conferencing).",
        "url": "/downloads/bog/IIITT_11th_BOG_Minutes.pdf"
    },

	"Minutes of The Tenth Meeting of The Board of Governors": {
        "description": "Minutes of The Tenth Meeting of The Board of Governors (Transit Board), held on 11 September, 2020 at 04:00PM (video conferencing).",
        "url": "/downloads/bog/IIITT_10th_BOG_Minutes.pdf"
    },
    
    "Minutes of The Ninth Meeting of The Board of Governors": {
        "description": "Minutes of The Ninth Meeting of The Board of Governors (Transit Board), held on 30 October, 2019 at 05:30PM.",
        "url": "/downloads/bog/9th_BoG_IIIT_3.10.19_5.30_pm0001.PDF"
    },
    "Minutes of The Eighth Meeting of The Board of Governors": {
        "description": "Minutes of The Eighth Meeting of The Board of Governors (Transit Board), held on 21 June, 2019 at 04:30PM.",
        "url": "/downloads/bog/IIITT_8th_BOG_Minutes.pdf"
    },
    "Minutes of The Seventh Meeting of The Board of Governors": {
        "description": "Minutes of The Seventh Meeting of The Board of Governors (Transit Board), held on 12 April, 2019 at 12:00PM.",
        "url": "/downloads/bog/IIITT_7th_BOG_Minutes.pdf"
    },
    "Minutes of The Sixth Meeting of The Board of Governors": {
        "description": "Minutes of The Sixth Meeting of The Board of Governors (Transit Board), held on 12 September, 2017 at 4PM.",
        "url": "/downloads/bog/IIITT_6th_BOG_Minutes.pdf"
    },
    "Minutes of The Fifth Meeting of The Board of Governors": {
        "description": "Minutes of The Fifth Meeting of The Board of Governors (Transit Board), held on 13 October, 2016 at 4PM.",
        "url": "/downloads/bog/IIITT_5th_BOG_Minutes.pdf"
    },
    "Proceedings of The Fourth Meeting of The Board of Governors": {
        "description": "Proceedings of the Fourth Meeting of The Board of Governors (Transit Board), held on 2 February, 2016 at 5PM.",
        "url": "/downloads/bog/IIITT_4th_BOG_Minutes.pdf"
    },
    "Proceedings of The Third Meeting of The Board of Governors": {
        "description": "Proceedings of the Third Meeting of The Board of Governors (Transit Board), held on 24 February, 2015 at 4:30PM.",
        "url": "/downloads/bog/IIITT_3rd_BOG_Minutes.pdf"
    },
    "Proceedings of The Second Meeting of The Board of Governors": {
        "description": "Proceedings of the Second Meeting of The Board of Governors (Transit Board), held on 12 November, 2014 at 5:30PM.",
        "url": "/downloads/bog/IIITT_2nd_BOG_Minutes.pdf"
    },
    "Proceedings of The First Meeting of The Board of Governors": {
        "description": "Proceedings of the First Meeting of The Board of Governors (Transit Board), held on 13 December, 2013 at 6PM.",
        "url": "/downloads/bog/IIITT_1st_BOG_Minutes.pdf"
    }
}
