{
	"Proceedings of The Ninth Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Ninth Meeting of The Finance Committee, held on 24 May, 2024 at 12:00PM (Hybrid mode).",
        "url": "/downloads/fc/IIITT_9_FC_Minutes.pdf"
    },
	"Proceedings of The Eighth Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Eighth Meeting of The Finance Committee, held on 24 November, 2023 at 10:15AM (Hybrid mode).",
        "url": "/downloads/fc/IIITT_8_FC_Minutes.pdf"
    },
	"Proceedings of The Seventh Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Seventh Meeting of The Finance Committee, held on 11 August, 2023 at 3:30PM (Hybrid mode).",
        "url": "/downloads/fc/IIITT_7_FC_Minutes.pdf"
    },
	"Proceedings of The Sixth Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Sixth Meeting of The Finance Committee, held on 28 January, 2023 at 3:00PM (video conferencing).",
        "url": "/downloads/fc/IIITT_6_FC_Minutes.pdf"
    },
    "Proceedings of The Fifth Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Fifth Meeting of The Finance Committee, held on 25 October, 2021 at 3:30PM (video conferencing).",
        "url": "/downloads/fc/IIITT_5_FC_Minutes.pdf"
    },
	"Proceedings of The Fourth Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Fourth Meeting of The Finance Committee, held on 11 September, 2020 at 3:45PM (video conferencing).",
        "url": "/downloads/fc/IIITT_4_FC_Minutes.pdf"
    },
    "Proceedings of The Third Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Third Meeting of The Finance Committee, held on 30 October, 2019 at 5:00PM.",
        "url": "/downloads/fc/IIITT_3_FC_Minutes.pdf"
    },
    "Proceedings of The Second Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the Second Meeting of The Finance Committee, held on 21 June, 2019 at 3:30PM.",
        "url": "/downloads/fc/IIITT_2_FC_Minutes.pdf"
    },
    "Proceedings of The First Meeting of The Finance Committee (FC)": {
        "description": "Proceedings of the First Meeting of The Finance Committee, held on 12 April, 2019 at 10:30PM.",
        "url": "/downloads/fc/IIITT_1_FC_Minutes.pdf"
    }
}
